driver-tests/sqlse/derby/createtabspchJbi/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <numRowsEffected xmlns="http://com.sun.jbi/sqlse/sqlseengine">0</numRowsEffected>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
